load/results/20260504-222404-nominal/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/paymei/Documents/Development/github/meyouquize/load/k6-http.js
        output: -

     scenarios: (100.00%) 1 scenario, 35 max VUs, 3m30s max duration (incl. graceful stop):
              * default: 35 looping VUs for 3m0s (gracefulStop: 30s)


running (0m01.0s), 35/35 VUs, 775 complete and 0 interrupted iterations
default   [   1% ] 35 VUs  0m01.0s/3m0s

running (0m02.0s), 35/35 VUs, 1781 complete and 0 interrupted iterations
default   [   1% ] 35 VUs  0m02.0s/3m0s

running (0m03.0s), 35/35 VUs, 2850 complete and 0 interrupted iterations
default   [   2% ] 35 VUs  0m03.0s/3m0s

running (0m04.0s), 35/35 VUs, 3942 complete and 0 interrupted iterations
default   [   2% ] 35 VUs  0m04.0s/3m0s

running (0m05.0s), 35/35 VUs, 5044 complete and 0 interrupted iterations
default   [   3% ] 35 VUs  0m05.0s/3m0s

running (0m06.0s), 35/35 VUs, 5945 complete and 0 interrupted iterations
default   [   3% ] 35 VUs  0m06.0s/3m0s

running (0m07.0s), 35/35 VUs, 7006 complete and 0 interrupted iterations
default   [   4% ] 35 VUs  0m07.0s/3m0s

running (0m08.0s), 35/35 VUs, 7988 complete and 0 interrupted iterations
default   [   4% ] 35 VUs  0m08.0s/3m0s

running (0m09.0s), 35/35 VUs, 8986 complete and 0 interrupted iterations
default   [   5% ] 35 VUs  0m09.0s/3m0s

running (0m10.0s), 35/35 VUs, 10086 complete and 0 interrupted iterations
default   [   6% ] 35 VUs  0m10.0s/3m0s

running (0m11.0s), 35/35 VUs, 11047 complete and 0 interrupted iterations
default   [   6% ] 35 VUs  0m11.0s/3m0s

running (0m12.0s), 35/35 VUs, 12062 complete and 0 interrupted iterations
default   [   7% ] 35 VUs  0m12.0s/3m0s

running (0m13.0s), 35/35 VUs, 13112 complete and 0 interrupted iterations
default   [   7% ] 35 VUs  0m13.0s/3m0s

running (0m14.0s), 35/35 VUs, 14082 complete and 0 interrupted iterations
default   [   8% ] 35 VUs  0m14.0s/3m0s

running (0m15.0s), 35/35 VUs, 15111 complete and 0 interrupted iterations
default   [   8% ] 35 VUs  0m15.0s/3m0s

running (0m16.0s), 35/35 VUs, 16138 complete and 0 interrupted iterations
default   [   9% ] 35 VUs  0m16.0s/3m0s

running (0m17.0s), 35/35 VUs, 17144 complete and 0 interrupted iterations
default   [   9% ] 35 VUs  0m17.0s/3m0s

running (0m18.0s), 35/35 VUs, 18175 complete and 0 interrupted iterations
default   [  10% ] 35 VUs  0m18.0s/3m0s

running (0m19.0s), 35/35 VUs, 19186 complete and 0 interrupted iterations
default   [  11% ] 35 VUs  0m19.0s/3m0s

running (0m20.0s), 35/35 VUs, 20184 complete and 0 interrupted iterations
default   [  11% ] 35 VUs  0m20.0s/3m0s

running (0m21.0s), 35/35 VUs, 21148 complete and 0 interrupted iterations
default   [  12% ] 35 VUs  0m21.0s/3m0s

running (0m22.0s), 35/35 VUs, 22126 complete and 0 interrupted iterations
default   [  12% ] 35 VUs  0m22.0s/3m0s

running (0m23.0s), 35/35 VUs, 23246 complete and 0 interrupted iterations
default   [  13% ] 35 VUs  0m23.0s/3m0s

running (0m24.0s), 35/35 VUs, 24275 complete and 0 interrupted iterations
default   [  13% ] 35 VUs  0m24.0s/3m0s

running (0m25.0s), 35/35 VUs, 25333 complete and 0 interrupted iterations
default   [  14% ] 35 VUs  0m25.0s/3m0s

running (0m26.0s), 35/35 VUs, 26292 complete and 0 interrupted iterations
default   [  14% ] 35 VUs  0m26.0s/3m0s

running (0m27.0s), 35/35 VUs, 27310 complete and 0 interrupted iterations
default   [  15% ] 35 VUs  0m27.0s/3m0s

running (0m28.0s), 35/35 VUs, 28291 complete and 0 interrupted iterations
default   [  16% ] 35 VUs  0m28.0s/3m0s

running (0m29.0s), 35/35 VUs, 29363 complete and 0 interrupted iterations
default   [  16% ] 35 VUs  0m29.0s/3m0s

running (0m30.0s), 35/35 VUs, 30396 complete and 0 interrupted iterations
default   [  17% ] 35 VUs  0m30.0s/3m0s

running (0m31.0s), 35/35 VUs, 31369 complete and 0 interrupted iterations
default   [  17% ] 35 VUs  0m31.0s/3m0s

running (0m32.0s), 35/35 VUs, 32439 complete and 0 interrupted iterations
default   [  18% ] 35 VUs  0m32.0s/3m0s

running (0m33.0s), 35/35 VUs, 33468 complete and 0 interrupted iterations
default   [  18% ] 35 VUs  0m33.0s/3m0s

running (0m34.0s), 35/35 VUs, 34475 complete and 0 interrupted iterations
default   [  19% ] 35 VUs  0m34.0s/3m0s

running (0m35.0s), 35/35 VUs, 35533 complete and 0 interrupted iterations
default   [  19% ] 35 VUs  0m35.0s/3m0s

running (0m36.0s), 35/35 VUs, 36615 complete and 0 interrupted iterations
default   [  20% ] 35 VUs  0m36.0s/3m0s

running (0m37.0s), 35/35 VUs, 37608 complete and 0 interrupted iterations
default   [  21% ] 35 VUs  0m37.0s/3m0s

running (0m38.0s), 35/35 VUs, 38695 complete and 0 interrupted iterations
default   [  21% ] 35 VUs  0m38.0s/3m0s

running (0m39.0s), 35/35 VUs, 39756 complete and 0 interrupted iterations
default   [  22% ] 35 VUs  0m39.0s/3m0s

running (0m40.0s), 35/35 VUs, 40667 complete and 0 interrupted iterations
default   [  22% ] 35 VUs  0m40.0s/3m0s

running (0m41.0s), 35/35 VUs, 41792 complete and 0 interrupted iterations
default   [  23% ] 35 VUs  0m41.0s/3m0s

running (0m42.0s), 35/35 VUs, 42875 complete and 0 interrupted iterations
default   [  23% ] 35 VUs  0m42.0s/3m0s

running (0m43.0s), 35/35 VUs, 43979 complete and 0 interrupted iterations
default   [  24% ] 35 VUs  0m43.0s/3m0s

running (0m44.0s), 35/35 VUs, 45029 complete and 0 interrupted iterations
default   [  24% ] 35 VUs  0m44.0s/3m0s

running (0m45.0s), 35/35 VUs, 46096 complete and 0 interrupted iterations
default   [  25% ] 35 VUs  0m45.0s/3m0s

running (0m46.0s), 35/35 VUs, 47126 complete and 0 interrupted iterations
default   [  26% ] 35 VUs  0m46.0s/3m0s

running (0m47.0s), 35/35 VUs, 48191 complete and 0 interrupted iterations
default   [  26% ] 35 VUs  0m47.0s/3m0s

running (0m48.0s), 35/35 VUs, 49183 complete and 0 interrupted iterations
default   [  27% ] 35 VUs  0m48.0s/3m0s

running (0m49.0s), 35/35 VUs, 50206 complete and 0 interrupted iterations
default   [  27% ] 35 VUs  0m49.0s/3m0s

running (0m50.0s), 35/35 VUs, 51119 complete and 0 interrupted iterations
default   [  28% ] 35 VUs  0m50.0s/3m0s

running (0m51.0s), 35/35 VUs, 52100 complete and 0 interrupted iterations
default   [  28% ] 35 VUs  0m51.0s/3m0s

running (0m52.0s), 35/35 VUs, 53233 complete and 0 interrupted iterations
default   [  29% ] 35 VUs  0m52.0s/3m0s

running (0m53.0s), 35/35 VUs, 54282 complete and 0 interrupted iterations
default   [  29% ] 35 VUs  0m53.0s/3m0s

running (0m54.0s), 35/35 VUs, 55345 complete and 0 interrupted iterations
default   [  30% ] 35 VUs  0m54.0s/3m0s

running (0m55.0s), 35/35 VUs, 56499 complete and 0 interrupted iterations
default   [  31% ] 35 VUs  0m55.0s/3m0s

running (0m56.0s), 35/35 VUs, 57533 complete and 0 interrupted iterations
default   [  31% ] 35 VUs  0m56.0s/3m0s

running (0m57.0s), 35/35 VUs, 58673 complete and 0 interrupted iterations
default   [  32% ] 35 VUs  0m57.0s/3m0s

running (0m58.0s), 35/35 VUs, 59684 complete and 0 interrupted iterations
default   [  32% ] 35 VUs  0m58.0s/3m0s

running (0m59.0s), 35/35 VUs, 60684 complete and 0 interrupted iterations
default   [  33% ] 35 VUs  0m59.0s/3m0s

running (1m00.0s), 35/35 VUs, 61775 complete and 0 interrupted iterations
default   [  33% ] 35 VUs  1m00.0s/3m0s

running (1m01.0s), 35/35 VUs, 62847 complete and 0 interrupted iterations
default   [  34% ] 35 VUs  1m01.0s/3m0s

running (1m02.0s), 35/35 VUs, 63905 complete and 0 interrupted iterations
default   [  34% ] 35 VUs  1m02.0s/3m0s

running (1m03.0s), 35/35 VUs, 65012 complete and 0 interrupted iterations
default   [  35% ] 35 VUs  1m03.0s/3m0s

running (1m04.0s), 35/35 VUs, 66050 complete and 0 interrupted iterations
default   [  36% ] 35 VUs  1m04.0s/3m0s

running (1m05.0s), 35/35 VUs, 66957 complete and 0 interrupted iterations
default   [  36% ] 35 VUs  1m05.0s/3m0s

running (1m06.0s), 35/35 VUs, 67908 complete and 0 interrupted iterations
default   [  37% ] 35 VUs  1m06.0s/3m0s

running (1m07.0s), 35/35 VUs, 68918 complete and 0 interrupted iterations
default   [  37% ] 35 VUs  1m07.0s/3m0s

running (1m08.0s), 35/35 VUs, 70043 complete and 0 interrupted iterations
default   [  38% ] 35 VUs  1m08.0s/3m0s

running (1m09.0s), 35/35 VUs, 70979 complete and 0 interrupted iterations
default   [  38% ] 35 VUs  1m09.0s/3m0s

running (1m10.0s), 35/35 VUs, 72058 complete and 0 interrupted iterations
default   [  39% ] 35 VUs  1m10.0s/3m0s

running (1m11.0s), 35/35 VUs, 73127 complete and 0 interrupted iterations
default   [  39% ] 35 VUs  1m11.0s/3m0s

running (1m12.0s), 35/35 VUs, 74135 complete and 0 interrupted iterations
default   [  40% ] 35 VUs  1m12.0s/3m0s

running (1m13.0s), 35/35 VUs, 75203 complete and 0 interrupted iterations
default   [  41% ] 35 VUs  1m13.0s/3m0s

running (1m14.0s), 35/35 VUs, 76194 complete and 0 interrupted iterations
default   [  41% ] 35 VUs  1m14.0s/3m0s

running (1m15.0s), 35/35 VUs, 77207 complete and 0 interrupted iterations
default   [  42% ] 35 VUs  1m15.0s/3m0s

running (1m16.0s), 35/35 VUs, 78351 complete and 0 interrupted iterations
default   [  42% ] 35 VUs  1m16.0s/3m0s

running (1m17.0s), 35/35 VUs, 79370 complete and 0 interrupted iterations
default   [  43% ] 35 VUs  1m17.0s/3m0s

running (1m18.0s), 35/35 VUs, 80414 complete and 0 interrupted iterations
default   [  43% ] 35 VUs  1m18.0s/3m0s

running (1m19.0s), 35/35 VUs, 81505 complete and 0 interrupted iterations
default   [  44% ] 35 VUs  1m19.0s/3m0s

running (1m20.0s), 35/35 VUs, 82625 complete and 0 interrupted iterations
default   [  44% ] 35 VUs  1m20.0s/3m0s

running (1m21.0s), 35/35 VUs, 83688 complete and 0 interrupted iterations
default   [  45% ] 35 VUs  1m21.0s/3m0s

running (1m22.0s), 35/35 VUs, 84527 complete and 0 interrupted iterations
default   [  46% ] 35 VUs  1m22.0s/3m0s

running (1m23.0s), 35/35 VUs, 85614 complete and 0 interrupted iterations
default   [  46% ] 35 VUs  1m23.0s/3m0s

running (1m24.0s), 35/35 VUs, 86696 complete and 0 interrupted iterations
default   [  47% ] 35 VUs  1m24.0s/3m0s

running (1m25.0s), 35/35 VUs, 87840 complete and 0 interrupted iterations
default   [  47% ] 35 VUs  1m25.0s/3m0s

running (1m26.0s), 35/35 VUs, 88937 complete and 0 interrupted iterations
default   [  48% ] 35 VUs  1m26.0s/3m0s

running (1m27.0s), 35/35 VUs, 90048 complete and 0 interrupted iterations
default   [  48% ] 35 VUs  1m27.0s/3m0s

running (1m28.0s), 35/35 VUs, 91152 complete and 0 interrupted iterations
default   [  49% ] 35 VUs  1m28.0s/3m0s

running (1m29.0s), 35/35 VUs, 92219 complete and 0 interrupted iterations
default   [  49% ] 35 VUs  1m29.0s/3m0s

running (1m30.0s), 35/35 VUs, 93378 complete and 0 interrupted iterations
default   [  50% ] 35 VUs  1m30.0s/3m0s

running (1m31.0s), 35/35 VUs, 94435 complete and 0 interrupted iterations
default   [  51% ] 35 VUs  1m31.0s/3m0s

running (1m32.0s), 35/35 VUs, 95488 complete and 0 interrupted iterations
default   [  51% ] 35 VUs  1m32.0s/3m0s

running (1m33.0s), 35/35 VUs, 96472 complete and 0 interrupted iterations
default   [  52% ] 35 VUs  1m33.0s/3m0s

running (1m34.0s), 35/35 VUs, 97553 complete and 0 interrupted iterations
default   [  52% ] 35 VUs  1m34.0s/3m0s

running (1m35.0s), 35/35 VUs, 98597 complete and 0 interrupted iterations
default   [  53% ] 35 VUs  1m35.0s/3m0s

running (1m36.0s), 35/35 VUs, 99619 complete and 0 interrupted iterations
default   [  53% ] 35 VUs  1m36.0s/3m0s

running (1m37.0s), 35/35 VUs, 100721 complete and 0 interrupted iterations
default   [  54% ] 35 VUs  1m37.0s/3m0s

running (1m38.0s), 35/35 VUs, 101714 complete and 0 interrupted iterations
default   [  54% ] 35 VUs  1m38.0s/3m0s

running (1m39.0s), 35/35 VUs, 102801 complete and 0 interrupted iterations
default   [  55% ] 35 VUs  1m39.0s/3m0s

running (1m40.0s), 35/35 VUs, 103939 complete and 0 interrupted iterations
default   [  56% ] 35 VUs  1m40.0s/3m0s

running (1m41.0s), 35/35 VUs, 105049 complete and 0 interrupted iterations
default   [  56% ] 35 VUs  1m41.0s/3m0s

running (1m42.0s), 35/35 VUs, 106109 complete and 0 interrupted iterations
default   [  57% ] 35 VUs  1m42.0s/3m0s

running (1m43.0s), 35/35 VUs, 107218 complete and 0 interrupted iterations
default   [  57% ] 35 VUs  1m43.0s/3m0s

running (1m44.0s), 35/35 VUs, 108340 complete and 0 interrupted iterations
default   [  58% ] 35 VUs  1m44.0s/3m0s

running (1m45.0s), 35/35 VUs, 109453 complete and 0 interrupted iterations
default   [  58% ] 35 VUs  1m45.0s/3m0s

running (1m46.0s), 35/35 VUs, 110531 complete and 0 interrupted iterations
default   [  59% ] 35 VUs  1m46.0s/3m0s

running (1m47.0s), 35/35 VUs, 111568 complete and 0 interrupted iterations
default   [  59% ] 35 VUs  1m47.0s/3m0s

running (1m48.0s), 35/35 VUs, 112783 complete and 0 interrupted iterations
default   [  60% ] 35 VUs  1m48.0s/3m0s

running (1m49.0s), 35/35 VUs, 113966 complete and 0 interrupted iterations
default   [  61% ] 35 VUs  1m49.0s/3m0s

running (1m50.0s), 35/35 VUs, 115123 complete and 0 interrupted iterations
default   [  61% ] 35 VUs  1m50.0s/3m0s

running (1m51.0s), 35/35 VUs, 116286 complete and 0 interrupted iterations
default   [  62% ] 35 VUs  1m51.0s/3m0s

running (1m52.0s), 35/35 VUs, 117493 complete and 0 interrupted iterations
default   [  62% ] 35 VUs  1m52.0s/3m0s

running (1m53.0s), 35/35 VUs, 118577 complete and 0 interrupted iterations
default   [  63% ] 35 VUs  1m53.0s/3m0s

running (1m54.0s), 35/35 VUs, 119778 complete and 0 interrupted iterations
default   [  63% ] 35 VUs  1m54.0s/3m0s

running (1m55.0s), 35/35 VUs, 121054 complete and 0 interrupted iterations
default   [  64% ] 35 VUs  1m55.0s/3m0s

running (1m56.0s), 35/35 VUs, 122223 complete and 0 interrupted iterations
default   [  64% ] 35 VUs  1m56.0s/3m0s

running (1m57.0s), 35/35 VUs, 123317 complete and 0 interrupted iterations
default   [  65% ] 35 VUs  1m57.0s/3m0s

running (1m58.0s), 35/35 VUs, 124483 complete and 0 interrupted iterations
default   [  66% ] 35 VUs  1m58.0s/3m0s

running (1m59.0s), 35/35 VUs, 125679 complete and 0 interrupted iterations
default   [  66% ] 35 VUs  1m59.0s/3m0s

running (2m00.0s), 35/35 VUs, 126924 complete and 0 interrupted iterations
default   [  67% ] 35 VUs  2m00.0s/3m0s

running (2m01.0s), 35/35 VUs, 128141 complete and 0 interrupted iterations
default   [  67% ] 35 VUs  2m01.0s/3m0s

running (2m02.0s), 35/35 VUs, 129241 complete and 0 interrupted iterations
default   [  68% ] 35 VUs  2m02.0s/3m0s

running (2m03.0s), 35/35 VUs, 130377 complete and 0 interrupted iterations
default   [  68% ] 35 VUs  2m03.0s/3m0s

running (2m04.0s), 35/35 VUs, 131456 complete and 0 interrupted iterations
default   [  69% ] 35 VUs  2m04.0s/3m0s

running (2m05.0s), 35/35 VUs, 132443 complete and 0 interrupted iterations
default   [  69% ] 35 VUs  2m05.0s/3m0s

running (2m06.0s), 35/35 VUs, 133428 complete and 0 interrupted iterations
default   [  70% ] 35 VUs  2m06.0s/3m0s

running (2m07.0s), 35/35 VUs, 134548 complete and 0 interrupted iterations
default   [  71% ] 35 VUs  2m07.0s/3m0s

running (2m08.0s), 35/35 VUs, 135677 complete and 0 interrupted iterations
default   [  71% ] 35 VUs  2m08.0s/3m0s

running (2m09.0s), 35/35 VUs, 136590 complete and 0 interrupted iterations
default   [  72% ] 35 VUs  2m09.0s/3m0s

running (2m10.0s), 35/35 VUs, 137732 complete and 0 interrupted iterations
default   [  72% ] 35 VUs  2m10.0s/3m0s

running (2m11.0s), 35/35 VUs, 138888 complete and 0 interrupted iterations
default   [  73% ] 35 VUs  2m11.0s/3m0s

running (2m12.0s), 35/35 VUs, 140042 complete and 0 interrupted iterations
default   [  73% ] 35 VUs  2m12.0s/3m0s

running (2m13.0s), 35/35 VUs, 141210 complete and 0 interrupted iterations
default   [  74% ] 35 VUs  2m13.0s/3m0s

running (2m14.0s), 35/35 VUs, 142298 complete and 0 interrupted iterations
default   [  74% ] 35 VUs  2m14.0s/3m0s

running (2m15.0s), 35/35 VUs, 143525 complete and 0 interrupted iterations
default   [  75% ] 35 VUs  2m15.0s/3m0s

running (2m16.0s), 35/35 VUs, 144646 complete and 0 interrupted iterations
default   [  76% ] 35 VUs  2m16.0s/3m0s

running (2m17.0s), 35/35 VUs, 145686 complete and 0 interrupted iterations
default   [  76% ] 35 VUs  2m17.0s/3m0s

running (2m18.0s), 35/35 VUs, 146777 complete and 0 interrupted iterations
default   [  77% ] 35 VUs  2m18.0s/3m0s

running (2m19.0s), 35/35 VUs, 147874 complete and 0 interrupted iterations
default   [  77% ] 35 VUs  2m19.0s/3m0s

running (2m20.0s), 35/35 VUs, 148981 complete and 0 interrupted iterations
default   [  78% ] 35 VUs  2m20.0s/3m0s

running (2m21.0s), 35/35 VUs, 150050 complete and 0 interrupted iterations
default   [  78% ] 35 VUs  2m21.0s/3m0s

running (2m22.0s), 35/35 VUs, 151202 complete and 0 interrupted iterations
default   [  79% ] 35 VUs  2m22.0s/3m0s

running (2m23.0s), 35/35 VUs, 152443 complete and 0 interrupted iterations
default   [  79% ] 35 VUs  2m23.0s/3m0s

running (2m24.0s), 35/35 VUs, 153632 complete and 0 interrupted iterations
default   [  80% ] 35 VUs  2m24.0s/3m0s

running (2m25.0s), 35/35 VUs, 154768 complete and 0 interrupted iterations
default   [  81% ] 35 VUs  2m25.0s/3m0s

running (2m26.0s), 35/35 VUs, 156007 complete and 0 interrupted iterations
default   [  81% ] 35 VUs  2m26.0s/3m0s

running (2m27.0s), 35/35 VUs, 157203 complete and 0 interrupted iterations
default   [  82% ] 35 VUs  2m27.0s/3m0s

running (2m28.0s), 35/35 VUs, 158380 complete and 0 interrupted iterations
default   [  82% ] 35 VUs  2m28.0s/3m0s

running (2m29.0s), 35/35 VUs, 159522 complete and 0 interrupted iterations
default   [  83% ] 35 VUs  2m29.0s/3m0s

running (2m30.0s), 35/35 VUs, 160717 complete and 0 interrupted iterations
default   [  83% ] 35 VUs  2m30.0s/3m0s

running (2m31.0s), 35/35 VUs, 162063 complete and 0 interrupted iterations
default   [  84% ] 35 VUs  2m31.0s/3m0s

running (2m32.0s), 35/35 VUs, 163186 complete and 0 interrupted iterations
default   [  84% ] 35 VUs  2m32.0s/3m0s

running (2m33.0s), 35/35 VUs, 164384 complete and 0 interrupted iterations
default   [  85% ] 35 VUs  2m33.0s/3m0s

running (2m34.0s), 35/35 VUs, 165504 complete and 0 interrupted iterations
default   [  86% ] 35 VUs  2m34.0s/3m0s

running (2m35.0s), 35/35 VUs, 166767 complete and 0 interrupted iterations
default   [  86% ] 35 VUs  2m35.0s/3m0s

running (2m36.0s), 35/35 VUs, 167919 complete and 0 interrupted iterations
default   [  87% ] 35 VUs  2m36.0s/3m0s

running (2m37.0s), 35/35 VUs, 168996 complete and 0 interrupted iterations
default   [  87% ] 35 VUs  2m37.0s/3m0s

running (2m38.0s), 35/35 VUs, 170121 complete and 0 interrupted iterations
default   [  88% ] 35 VUs  2m38.0s/3m0s

running (2m39.0s), 35/35 VUs, 171123 complete and 0 interrupted iterations
default   [  88% ] 35 VUs  2m39.0s/3m0s

running (2m40.0s), 35/35 VUs, 172263 complete and 0 interrupted iterations
default   [  89% ] 35 VUs  2m40.0s/3m0s

running (2m41.0s), 35/35 VUs, 173412 complete and 0 interrupted iterations
default   [  89% ] 35 VUs  2m41.0s/3m0s

running (2m42.0s), 35/35 VUs, 174621 complete and 0 interrupted iterations
default   [  90% ] 35 VUs  2m42.0s/3m0s

running (2m43.0s), 35/35 VUs, 175695 complete and 0 interrupted iterations
default   [  91% ] 35 VUs  2m43.0s/3m0s

running (2m44.0s), 35/35 VUs, 176895 complete and 0 interrupted iterations
default   [  91% ] 35 VUs  2m44.0s/3m0s

running (2m45.0s), 35/35 VUs, 178139 complete and 0 interrupted iterations
default   [  92% ] 35 VUs  2m45.0s/3m0s

running (2m46.0s), 35/35 VUs, 179193 complete and 0 interrupted iterations
default   [  92% ] 35 VUs  2m46.0s/3m0s

running (2m47.0s), 35/35 VUs, 180314 complete and 0 interrupted iterations
default   [  93% ] 35 VUs  2m47.0s/3m0s

running (2m48.0s), 35/35 VUs, 181648 complete and 0 interrupted iterations
default   [  93% ] 35 VUs  2m48.0s/3m0s

running (2m49.0s), 35/35 VUs, 182851 complete and 0 interrupted iterations
default   [  94% ] 35 VUs  2m49.0s/3m0s

running (2m50.0s), 35/35 VUs, 184141 complete and 0 interrupted iterations
default   [  94% ] 35 VUs  2m50.0s/3m0s

running (2m51.0s), 35/35 VUs, 185277 complete and 0 interrupted iterations
default   [  95% ] 35 VUs  2m51.0s/3m0s

running (2m52.0s), 35/35 VUs, 186462 complete and 0 interrupted iterations
default   [  96% ] 35 VUs  2m52.0s/3m0s

running (2m53.0s), 35/35 VUs, 187564 complete and 0 interrupted iterations
default   [  96% ] 35 VUs  2m53.0s/3m0s

running (2m54.0s), 35/35 VUs, 188632 complete and 0 interrupted iterations
default   [  97% ] 35 VUs  2m54.0s/3m0s

running (2m55.0s), 35/35 VUs, 189705 complete and 0 interrupted iterations
default   [  97% ] 35 VUs  2m55.0s/3m0s

running (2m56.0s), 35/35 VUs, 190791 complete and 0 interrupted iterations
default   [  98% ] 35 VUs  2m56.0s/3m0s

running (2m57.0s), 35/35 VUs, 191959 complete and 0 interrupted iterations
default   [  98% ] 35 VUs  2m57.0s/3m0s

running (2m58.0s), 35/35 VUs, 193156 complete and 0 interrupted iterations
default   [  99% ] 35 VUs  2m58.0s/3m0s

running (2m59.0s), 35/35 VUs, 194289 complete and 0 interrupted iterations
default   [  99% ] 35 VUs  2m59.0s/3m0s

running (3m00.0s), 35/35 VUs, 195397 complete and 0 interrupted iterations
default   [ 100% ] 35 VUs  3m00.0s/3m0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=21.27ms
    ✓ 'p(99)<900' p(99)=231.91ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 390882  2169.432764/s
    checks_succeeded...: 100.00% 390882 out of 390882
    checks_failed......: 0.00%   0 out of 390882

    ✓ healthz:200
    ✓ readyz:200

    HTTP
    http_req_duration..............: avg=16.05ms min=4.89ms  med=11.34ms max=660.74ms p(90)=16.9ms  p(95)=21.27ms
      { expected_response:true }...: avg=16.05ms min=4.89ms  med=11.34ms max=660.74ms p(90)=16.9ms  p(95)=21.27ms
    http_req_failed................: 0.00%  0 out of 390882
    http_reqs......................: 390882 2169.432764/s

    EXECUTION
    iteration_duration.............: avg=32.23ms min=12.52ms med=23.26ms max=681.11ms p(90)=33.91ms p(95)=43.54ms
    iterations.....................: 195441 1084.716382/s
    vus............................: 35     min=35          max=35
    vus_max........................: 35     min=35          max=35

    NETWORK
    data_received..................: 182 MB 1.0 MB/s
    data_sent......................: 15 MB  85 kB/s



running (3m00.2s), 00/35 VUs, 195441 complete and 0 interrupted iterations
default ✓ [ 100% ] 35 VUs  3m0s